; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-4-4-253)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p1-0 - location
	p1-3 - location
	p1-4 - location
	p2-1 - location
	p2-4 - location
	p3-0 - location
	p4-0 - location
	p4-3 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s3)
	(at driver4 s1)
	(at driver5 s2)
	(at truck1 s1)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s0)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s4)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at package1 s4)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 2)
	(= (time-to-walk p1-0 s1) 2)
	(= (time-to-walk s0 p1-0) 13)
	(= (time-to-walk p1-0 s0) 13)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 17)
	(= (time-to-walk p1-3 s1) 17)
	(= (time-to-walk s3 p1-3) 12)
	(= (time-to-walk p1-3 s3) 12)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 2)
	(= (time-to-walk p1-4 s1) 2)
	(= (time-to-walk s4 p1-4) 2)
	(= (time-to-walk p1-4 s4) 2)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(= (time-to-walk s2 p2-1) 7)
	(= (time-to-walk p2-1 s2) 7)
	(= (time-to-walk s1 p2-1) 14)
	(= (time-to-walk p2-1 s1) 14)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 1)
	(= (time-to-walk p2-4 s2) 1)
	(= (time-to-walk s4 p2-4) 5)
	(= (time-to-walk p2-4 s4) 5)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(= (time-to-walk s3 p3-0) 2)
	(= (time-to-walk p3-0 s3) 2)
	(= (time-to-walk s0 p3-0) 8)
	(= (time-to-walk p3-0 s0) 8)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 7)
	(= (time-to-walk p4-0 s4) 7)
	(= (time-to-walk s0 p4-0) 15)
	(= (time-to-walk p4-0 s0) 15)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 15)
	(= (time-to-walk p4-3 s4) 15)
	(= (time-to-walk s3 p4-3) 17)
	(= (time-to-walk p4-3 s3) 17)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 9)
	(= (time-to-drive s2 s1) 9)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 14)
	(= (time-to-drive s0 s4) 14)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 10)
	(= (time-to-drive s1 s4) 10)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 4)
	(= (time-to-drive s1 s0) 4)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 4)
	(= (time-to-drive s0 s2) 4)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 15)
	(= (time-to-drive s4 s2) 15)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 16)
	(= (time-to-drive s1 s3) 16)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 2)
	(= (time-to-drive s4 s3) 2)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s4)
	(at truck1 s2)
	(at truck3 s1)
	(at truck4 s3)
	(at package1 s4)
	(at package2 s1)
	(at package3 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver3 truck3 s3)
   deleted: (at driver3 s3) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 3 of 10
2. (drive-truck truck3 s3 s1 driver3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   changed: (fuel-used) from 0 to 160
   goals met: 4 of 10
3. (walk driver4 s1 p1-4)
   deleted: (at driver4 s1)
   added: (at driver4 p1-4)
   goals met: 4 of 10
4. (walk driver4 p1-4 s4)
   deleted: (at driver4 p1-4)
   added: (at driver4 s4)
   goals met: 5 of 10
5. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   goals met: 5 of 10
6. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   goals met: 6 of 10
7. (disembark-truck driver3 truck3 s1)
   deleted: (driving driver3 truck3)
   added: (at driver3 s1) (empty truck3)
   goals met: 6 of 10
8. (load-truck package3 truck2 s0)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 6 of 10
9. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 5 of 10
10. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (fuel-used) from 160 to 204
   goals met: 5 of 10
11. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 6 of 10
12. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (fuel-used) from 204 to 244
   goals met: 6 of 10
13. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 7 of 10
14. (walk driver3 s1 p2-1)
   deleted: (at driver3 s1)
   added: (at driver3 p2-1)
   goals met: 7 of 10
15. (walk driver3 p2-1 s2)
   deleted: (at driver3 p2-1)
   added: (at driver3 s2)
   goals met: 8 of 10
16. (board-truck driver4 truck4 s4)
   deleted: (at driver4 s4) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 7 of 10
17. (drive-truck truck4 s4 s1 driver4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   changed: (fuel-used) from 244 to 344
   goals met: 7 of 10
18. (disembark-truck driver4 truck4 s1)
   deleted: (driving driver4 truck4)
   added: (at driver4 s1) (empty truck4)
   goals met: 7 of 10
19. (board-truck driver4 truck1 s1)
   deleted: (at driver4 s1) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 7 of 10
20. (drive-truck truck1 s1 s4 driver4)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 344 to 444
   goals met: 7 of 10
21. (walk driver3 s2 p2-1)
   deleted: (at driver3 s2)
   added: (at driver3 p2-1)
   goals met: 6 of 10
22. (walk driver3 p2-1 s1)
   deleted: (at driver3 p2-1)
   added: (at driver3 s1)
   goals met: 6 of 10
23. (board-truck driver3 truck4 s1)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 6 of 10
24. (drive-truck truck4 s1 s3 driver3)
   deleted: (at truck4 s1)
   added: (at truck4 s3)
   changed: (fuel-used) from 444 to 604
   goals met: 7 of 10
25. (disembark-truck driver3 truck4 s3)
   deleted: (driving driver3 truck4)
   added: (at driver3 s3) (empty truck4)
   goals met: 7 of 10
26. (drive-truck truck1 s4 s3 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   changed: (fuel-used) from 604 to 624
   goals met: 7 of 10
27. (disembark-truck driver4 truck1 s3)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 7 of 10
28. (board-truck driver3 truck1 s3)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 7 of 10
29. (walk driver4 s3 p4-3)
   deleted: (at driver4 s3)
   added: (at driver4 p4-3)
   goals met: 7 of 10
30. (walk driver4 p4-3 s4)
   deleted: (at driver4 p4-3)
   added: (at driver4 s4)
   goals met: 8 of 10
31. (drive-truck truck1 s3 s4 driver3)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (fuel-used) from 624 to 644
   goals met: 8 of 10
32. (drive-truck truck1 s4 s2 driver3)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 644 to 794
   goals met: 9 of 10
33. (disembark-truck driver3 truck1 s2)
   deleted: (driving driver3 truck1)
   added: (at driver3 s2) (empty truck1)
   goals met: 10 of 10
